Repository: uKaigo/discord.py
Catalog: docs/locale/*/LC_MESSAGES/discord.po
Languages: pt_br

source: Creating a Bot Account
pt_br: Criando uma Conta de Bot

source: In order to work with the library and the Discord API in general, we must first create a Discord Bot account.
pt_br: Para trabalhar com a biblioteca e a API do Discord em geral, precisamos primeiro criar uma conta de Bot do Discord.

source: Creating a Bot account is a pretty straightforward process.
pt_br: Criar uma conta Bot é um processo muito simples.

source: Make sure you're logged on to the `Discord website <https://discord.com>`_.
pt_br: Certifique-se de estar logado no `website do Discord <https://discord.com>`_.

source: Navigate to the `application page <https://discord.com/developers/applications>`_
pt_br: Navegue para a `página da aplicação <https://discord.com/developers/applications>`_

source: Click on the "New Application" button.
pt_br: Clique no botão "New Application".

source: Give the application a name and click "Create".
pt_br: Dê um nome ao aplicativo e clique em "Create".

source: Create a Bot User by navigating to the "Bot" tab and clicking "Add Bot".
pt_br: Crie um usuário Bot navegando até a aba "Bot" e clicando em "Add Bot".

source: Click "Yes, do it!" to continue.
pt_br: Clique em "Yes, do it!" para continuar.

source: Make sure that **Public Bot** is ticked if you want others to invite your bot.
pt_br: Certifique-se de que o **Public bot** esteja marcado se quiser que outros convidem o seu bot.

source: You should also make sure that **Require OAuth2 Code Grant** is unchecked unless you are developing a service that needs it. If you're unsure, then **leave it unchecked**.
pt_br: Você também deve se certificar de que **Require OAuth2 Code Grant** está desmarcado, a menos que você esteja desenvolvendo um serviço que precisa disso. Se você não tem certeza, então **deixe ele desmarcado**.

source: Copy the token using the "Copy" button.
pt_br: Copie o token usando o botão "Copy".

source: **This is not the Client Secret at the General Information page.**
pt_br: **Este não é o Client Secret na página General Information.**

source: It should be worth noting that this token is essentially your bot's password. You should **never** share this to someone else. In doing so, someone can log in to your bot and do malicious things, such as leaving servers, ban all members inside a server, or pinging everyone maliciously.
pt_br: Vale a pena notar que este token é essencialmente a senha do seu bot. Você **nunca** deve compartilhar isso com outra pessoa. Ao fazer isso, alguém pode acessar seu bot e fazer coisas maliciosas, como deixar os servidores, banir todos os membros dentro de um servidor ou mencionar todos maliciosamente.

source: The possibilities are endless, so **do not share this token.**
pt_br: As possibilidades são infinitas, então **não compartilhe esse token.**

source: If you accidentally leaked your token, click the "Regenerate" button as soon as possible. This revokes your old token and re-generates a new one. Now you need to use the new token to login.
pt_br: Se você vazou acidentalmente seu token, clique no botão "Regenerate" o mais rápido possível. Isso revoga seu antigo token e gera um novo. Agora você precisa usar o novo token para fazer login.

source: And that's it. You now have a bot account and you can login with that token.
pt_br: E é isso. Agora você tem uma conta bot e pode fazer o login com esse token.

source: Inviting Your Bot
pt_br: Convidando seu Bot

source: So you've made a Bot User but it's not actually in any server.
pt_br: Então você criou um usuário Bot mas não está em nenhum servidor.

source: If you want to invite your bot you must create an invite URL for it.
pt_br: Se você deseja convidar seu bot, você deve criar um URL de convite para ele.

source: Click on your bot's page.
pt_br: Clique na página do seu bot.

source: Go to the "OAuth2" tab.
pt_br: Vá para a aba "OAuth2".

source: Tick the "bot" checkbox under "scopes".
pt_br: Marque a caixa de seleção "bot" abaixo de "scopes".

source: Tick the permissions required for your bot to function under "Bot Permissions".
pt_br: Marque as permissões necessárias para que o seu bot funcione sob "Bot Permissions".

source: Please be aware of the consequences of requiring your bot to have the "Administrator" permission.
pt_br: Por favor, esteja ciente das consequências de exigir que o bot tenha a permissão "Administrator".

source: Now the resulting URL can be used to add your bot to a server. Copy and paste the URL into your browser, choose a server to invite the bot to, and click "Authorize".
pt_br: Agora, a URL resultante pode ser usada para adicionar o seu bot a um servidor. Copie e cole a URL no seu navegador, escolha um servidor para o qual convidar o bot e clique em "Autorizar".

source: The person adding the bot needs "Manage Server" permissions to do so.
pt_br: A pessoa que estiver adicionando o bot precisa das permissões "Gerenciar Servidor" para fazer isso.

source: If you want to generate this URL dynamically at run-time inside your bot and using the :class:`discord.Permissions` interface, you can use :func:`discord.utils.oauth_url`.
pt_br: Se você quer gerar esse URL dinamicamente em tempo de execução dentro de seu bot e usando a interface de :class:`discord.Permissions`, você pode usar :func:`discord.utils.oauth_url`.
