Repository: uKaigo/discord.py
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: pt

source: Frequently Asked Questions
pt: Perguntas Frequentes

source: This is a list of Frequently Asked Questions regarding using ``discord.py`` and its extension modules. Feel free to suggest a new question or submit one via pull requests.
pt: Esta é uma lista de perguntas frequentes sobre o uso de ``discord.py`` e suas extensões. Sinta-se livre para sugerir uma nova pergunta ou enviar uma via pull requests.

source: Questions
pt: Perguntas

source: Questions regarding coroutines and asyncio belong here.
pt: As perguntas relacionadas às coroutines e asyncio pertencem aqui.

source: What is a coroutine?
pt: O que é uma coroutine?

source: A |coroutine_link|_ is a function that must be invoked with ``await`` or ``yield from``. When Python encounters an ``await`` it stops the function's execution at that point and works on other things until it comes back to that point and finishes off its work. This allows for your program to be doing multiple things at the same time without using threads or complicated multiprocessing.
pt: Uma |coroutine_link|_ é uma função que deve ser invocada com ``await`` ou ``yield from``. Quando o Python encontra um ``await``, interrompe a execução da função naquele ponto e trabalha em outras coisas até voltar a esse ponto e terminar o seu trabalho. Isso permite que seu programa faça várias coisas ao mesmo tempo, sem usar threads ou multiprocessamentos complicados.

source: **If you forget to await a coroutine then the coroutine will not run. Never forget to await a coroutine.**
pt: **Se você esquecer de usar await em uma coroutine, a coroutine não será executada. Nunca se esqueca de usar await em uma coroutine.**

source: Where can I use ``await``\?
pt: Onde posso usar ``await``\?

source: You can only use ``await`` inside ``async def`` functions and nowhere else.
pt: Você só pode usar ``await`` dentro de funções ``async def`` e em nenhum outro lugar.

source: What does "blocking" mean?
pt: O que significa "blocking"?

source: In asynchronous programming a blocking call is essentially all the parts of the function that are not ``await``. Do not despair however, because not all forms of blocking are bad! Using blocking calls is inevitable, but you must work to make sure that you don't excessively block functions. Remember, if you block for too long then your bot will freeze since it has not stopped the function's execution at that point to do other things.
pt: Em programação assíncrona uma chamada blocking é, essencialmente, todas as partes da função que não são ``await``. Mas não se desespere, porque nem todas as formas de bloqueio são ruins! Usar chamadas com bloqueio é inevitável, mas você deve trabalhar para garantir que você não bloqueie demais as funções. Lembre-se, se você bloquear por muito tempo então seu bot irá congelar, já que ele não interrompeu a execução da função naquele ponto para fazer outras coisas.

source: If logging is enabled, this library will attempt to warn you that blocking is occurring with the message: ``Heartbeat blocked for more than N seconds.`` See :ref:`logging_setup` for details on enabling logging.
pt: Se logging estiver ativado, essa biblioteca tentará avisá-lo que o blocking está ocorrendo com a mensagem: ``Heartbeat blocked for more than N seconds.`` Veja :ref:`logging_setup` para detalhes sobre como habilitar logging.

source: A common source of blocking for too long is something like :func:`time.sleep`. Don't do that. Use :func:`asyncio.sleep` instead. Similar to this example: ::
pt: Uma fonte comum de blocking por muito tempo é algo como :func:`time.sleep`. Não faça isso. Use :func:`asyncio.sleep`. Similar a este exemplo: ::

source: Another common source of blocking for too long is using HTTP requests with the famous module :doc:`req:index`. While :doc:`req:index` is an amazing module for non-asynchronous programming, it is not a good choice for :mod:`asyncio` because certain requests can block the event loop too long. Instead, use the :doc:`aiohttp <aio:index>` library which is installed on the side with this library.
pt: Outra fonte comum de blocking por muito tempo é usar solicitações HTTP com o famoso módulo :doc:`req:index`. Enquanto :doc:`req:index` é um módulo incrível para programação não assíncrona, não é uma boa escolha para :mod:`asyncio` porque certas solicitações podem bloquear o loop de eventos por muito tempo. Em vez disso, use a biblioteca :doc:`aiohttp <aio:index>` que está instalada junto com essa biblioteca.

source: Consider the following example: ::
pt: Considere o seguinte exemplo: ::

source: General
pt: Geral

source: General questions regarding library usage belong here.
pt: As perguntas gerais sobre o uso da biblioteca pertencem aqui.

source: Where can I find usage examples?
pt: Onde posso encontrar exemplos de uso?

source: Example code can be found in the `examples folder <https://github.com/Rapptz/discord.py/tree/master/examples>`_ in the repository.
pt: Exemplo de códigos pode ser encontrado na `pasta de exemplos <https://github.com/Rapptz/discord.py/tree/master/examples>`_ no repositório.

source: How do I set the "Playing" status?
pt: Como faço para definir o status "Jogando"?

source: There is a method for this under :class:`Client` called :meth:`Client.change_presence`. The relevant aspect of this is its ``activity`` keyword argument which takes in an :class:`Activity` object.
pt: Há um método para isso sob :class:`Client` chamado :meth:`Client.change_presence`. O aspecto relevante disso é o seu argumento nomeado ``activity`` que recebe um objeto :class:`Activity`.

source: The status type (playing, listening, streaming, watching) can be set using the :class:`ActivityType` enum. For memory optimisation purposes, some activities are offered in slimmed down versions:
pt: O tipo de status (jogando, ouvindo, transmitindo, assistindo) pode ser definido usando o enum :class:`ActivityType`. Para fins de otimização de memória, algumas atividades são oferecidas em versões reduzidas:

source: Putting both of these pieces of info together, you get the following: ::
pt: Juntando essas duas informações, você obtém o seguinte: ::

source: How do I send a message to a specific channel?
pt: Como eu mando uma mensagem para um canal específico?

source: You must fetch the channel directly and then call the appropriate method. Example: ::
pt: Você deve buscar o canal diretamente e então chamar o método apropriado. Exemplo: ::

source: How do I send a DM?
pt: Como faço para enviar uma mensagem em DM?

source: Get the :class:`User` or :class:`Member` object and call :meth:`abc.Messageable.send`. For example: ::
pt: Obtenha o objeto :class:`User` ou :class:`Member` e use :meth:`abc.Messageable.send`. Por exemplo: ::

source: If you are responding to an event, such as :func:`on_message`, you already have the :class:`User` object via :attr:`Message.author`: ::
pt: Se você estiver respondendo a um evento, como :func:`on_message`, você já tem o objeto :class:`User` via :attr:`Message.author`: ::

source: How do I get the ID of a sent message?
pt: Como faço para obter o ID de uma mensagem enviada?

source: :meth:`abc.Messageable.send` returns the :class:`Message` that was sent. The ID of a message can be accessed via :attr:`Message.id`: ::
pt: :meth:`abc.Messageable.send` retorna a :class:`Message` que foi enviada. O ID de uma mensagem pode ser acessada através de :attr:`Message.id`: ::

source: How do I upload an image?
pt: Como eu envio uma imagem?

source: To upload something to Discord you have to use the :class:`File` object.
pt: Para enviar algo para o Discord você tem que usar o objeto :class:`File`.

source: A :class:`File` accepts two parameters, the file-like object (or file path) and the filename to pass to Discord when uploading.
pt: Um :class:`File` aceita dois parâmetros, o arquivo ou similar (ou caminho para o arquivo) e o nome do arquivo para passar para o Discord ao enviar.

source: If you want to upload an image it's as simple as: ::
pt: Se você quer enviar uma imagem é simples como: ::

source: If you have a file-like object you can do as follows: ::
pt: Se você tem um objeto arquivo ou similar, você pode fazer o seguinte: ::

source: To upload multiple files, you can use the ``files`` keyword argument instead of ``file``\: ::
pt: Para enviar vários arquivos, você pode usar o argumento nomeado ``files``, em vez de ``file``: ::

source: If you want to upload something from a URL, you will have to use an HTTP request using :doc:`aiohttp <aio:index>` and then pass an :class:`io.BytesIO` instance to :class:`File` like so:
pt: Se você quiser enviar alguma coisa de uma URL, você terá que usar uma solicitação HTTP usando o :doc:`aiohttp <aio:index>` e depois passar um :class:`io.BytesIO` para :class:`File` da seguinte forma:

source: How can I add a reaction to a message?
pt: Como posso adicionar uma reação a uma mensagem?

source: You use the :meth:`Message.add_reaction` method.
pt: Você usa o método :meth:`Message.add_reaction`.

source: If you want to use unicode emoji, you must pass a valid unicode code point in a string. In your code, you can write this in a few different ways:
pt: Se você quiser usar emoji unicode, você deve passar um ponto unicode válido em uma string. No seu código, você pode escrever isso de algumas maneiras diferentes:

source: Quick example: ::
pt: Exemplo rápido: ::

source: In case you want to use emoji that come from a message, you already get their code points in the content without needing to do anything special. You **cannot** send ``':thumbsup:'`` style shorthands.
pt: Caso você queira usar emojis que venham de uma mensagem, você já recebe seus pontos de código no conteúdo sem precisar fazer nada de especial. Você **não pode** enviar abreviações como ``':thumbsup:'``.

source: For custom emoji, you should pass an instance of :class:`Emoji`. You can also pass a ``'<:name:id>'`` string, but if you can use said emoji, you should be able to use :meth:`Client.get_emoji` to get an emoji via ID or use :func:`utils.find`/ :func:`utils.get` on :attr:`Client.emojis` or :attr:`Guild.emojis` collections.
pt: Para emojis personalizados, você deve passar uma instância de :class:`Emoji`. Você também pode passar uma string ``'<:nome:id>'``, mas se você puder usar esse emoji, você deverá conseguir usar :meth:`Client.get_emoji` para obter um emoji via ID ou usar :func:`utils.find`/ :func:`utils.get` nas coleções :attr:`Client.emojis` ou :attr:`Guild.emojis`.

source: The name and ID of a custom emoji can be found with the client by prefixing ``:custom_emoji:`` with a backslash. For example, sending the message ``\:python3:`` with the client will result in ``<:python3:232720527448342530>``.
pt: O nome e o ID de um emoji personalizado podem ser encontrados com o cliente ao prefixar ``:custom_emoji:`` com uma barra invertida. Por exemplo, enviar a mensagem ``\:python3:`` com o cliente resultará em ``<:python3:232720527448342530>``.

source: How do I pass a coroutine to the player's "after" function?
pt: Como eu passo uma coroutine para a função "after" do tocador?

source: The library's music player launches on a separate thread, ergo it does not execute inside a coroutine. This does not mean that it is not possible to call a coroutine in the ``after`` parameter. To do so you must pass a callable that wraps up a couple of aspects.
pt: O tocador de música da biblioteca lança em um thread separado, logo ele não é executado dentro de uma coroutine. Isto não significa que não é possível chamar uma coroutine no parâmetro ``after``. Para fazer isso, tem de passar um callable que engloba alguns aspectos.

source: The first gotcha that you must be aware of is that calling a coroutine is not a thread-safe operation. Since we are technically in another thread, we must take caution in calling thread-safe operations so things do not bug out. Luckily for us, :mod:`asyncio` comes with a :func:`asyncio.run_coroutine_threadsafe` function that allows us to call a coroutine from another thread.
pt: A primeira falha que você deve estar ciente é que chamar uma coroutine não é uma operação segura para threads. Uma vez que estamos tecnicamente em outra thread, devemos ter cuidado em chamar operações seguras para as coisas não darem problemas. Felizmente para nós, o :mod:`asyncio` vem com uma função :func:`asyncio.run_coroutine_threadsafe` que nos permite chamar um coroutine de outra thread.

source: However, this function returns a :class:`concurrent.Future` and to actually call it we have to fetch its result. Putting all of this together we can do the following: ::
pt: No entanto, essa função retorna um :class:`concurrent.Future` e para realmente chamá-la precisamos buscar seu resultado. Juntando tudo isso, podemos fazer o seguinte: ::

source: How do I run something in the background?
pt: Como faço para executar algo em segundo plano?

source: `Check the background_task.py example. <https://github.com/Rapptz/discord.py/blob/master/examples/background_task.py>`_
pt: `Veja o exemplo background_task.py. <https://github.com/Rapptz/discord.py/blob/master/examples/background_task.py>`_

source: How do I get a specific model?
pt: Como faço para obter um modelo específico?

source: There are multiple ways of doing this. If you have a specific model's ID then you can use one of the following functions:
pt: Existem várias maneiras de fazer isso. Se você tem um ID de um modelo específico então você pode usar uma das seguintes funções:

source: The following use an HTTP request:
pt: O seguinte usa uma solicitação HTTP:

source: If the functions above do not help you, then use of :func:`utils.find` or :func:`utils.get` would serve some use in finding specific models.
pt: Se as funções acima não te ajudarem, então o uso de :func:`utils.find` ou :func:`utils.get` serviria para encontrar modelos específicos.

source: How do I make a web request?
pt: Como faço uma solicitação web?

source: To make a request, you should use a non-blocking library. This library already uses and requires a 3rd party library for making requests, ``aiohttp``.
pt: Para fazer uma solicitação, você deve usar uma biblioteca não blocking. Esta biblioteca já usa e requer uma biblioteca de terceiros para fazer solicitações, ``aiohttp``.

source: See `aiohttp's full documentation <http://aiohttp.readthedocs.io/en/stable/>`_ for more information.
pt: Veja a `documentação completa do aiohttp <http://aiohttp.readthedocs.io/en/stable/>`_ para mais informações.

source: How do I use a local image file for an embed image?
pt: Como eu uso um arquivo de imagem local em uma imagem no embed?

source: Discord special-cases uploading an image attachment and using it within an embed so that it will not display separately, but instead in the embed's thumbnail, image, footer or author icon.
pt: Casas especiais do Discord enviando um anexo de imagem e usando-o dentro de um embed para que não seja exibido separadamente, mas em vez disso no ícone da miniatura, imagem, rodapé ou autor do embed.

source: To do so, upload the image normally with :meth:`abc.Messageable.send`, and set the embed's image URL to ``attachment://image.png``, where ``image.png`` is the filename of the image you will send.
pt: Para fazer isso, envie a imagem normalmente usando :meth:`abc.Messageable.send`, e defina a URL da imagem do embed para ``attachment://imagem.png``, onde ``imagem.png`` é o nome da imagem que você vai enviar.

source: Due to a Discord limitation, filenames may not include underscores.
pt: Devido a uma limitação do Discord, nomes de arquivos não podem ter underscore.

source: Is there an event for audit log entries being created?
pt: Existe um evento para entradas sendo criadas no registro de auditoria?

source: Since Discord does not dispatch this information in the gateway, the library cannot provide this information. This is currently a Discord limitation.
pt: Como o Discord não envia essas informações no gateway, a biblioteca não pode fornecer essas informações. Isso é uma limitação do Discord.

source: Commands Extension
pt: Extensão de Comandos

source: Questions regarding ``discord.ext.commands`` belong here.
pt: Perguntas sobre ``discord.ext.commands`` pertencem aqui.

source: Why does ``on_message`` make my commands stop working?
pt: Por que ``on_message`` faz meus comandos pararem de funcionar?

source: Overriding the default provided ``on_message`` forbids any extra commands from running. To fix this, add a ``bot.process_commands(message)`` line at the end of your ``on_message``. For example: ::
pt: Sobrescrever ``on_message`` padrão proíbe qualquer comando extra de ser executado. Para corrigir isso, adicione uma linha ``bot.process_commands(message)`` no final do seu ``on_message``. Por exemplo: ::

source: Alternatively, you can place your ``on_message`` logic into a **listener**. In this setup, you should not manually call ``bot.process_commands()``. This also allows you to do multiple things asynchronously in response to a message. Example::
pt: Como alternativa, você pode colocar sua lógica ``on_message`` em um **listener**. Nesta configuração, você não deve chamar manualmente ``bot.process_commands()``. Isso também permite que você faça várias coisas assincronamente em resposta a uma mensagem. Exemplo::

source: Why do my arguments require quotes?
pt: Por que meus argumentos precisam de aspas?

source: In a simple command defined as: ::
pt: Em um comando simples definido como: ::

source: Calling it via ``?echo a b c`` will only fetch the first argument and disregard the rest. To fix this you should either call it via ``?echo "a b c"`` or change the signature to have "consume rest" behaviour. Example: ::
pt: Chamando isso via ``?echo a b c`` irá buscar apenas o primeiro argumento e ignorar o resto. Para corrigir este problema, você deve chamá-lo por ``?echo "b c"`` ou mudar a assinatura para ter o comportamento de "consumo de repouso". Exemplo: ::

source: This will allow you to use ``?echo a b c`` without needing the quotes.
pt: Isso permitirá que você use ``?echo a b c`` sem precisar das aspas.

source: How do I get the original ``message``\?
pt: Como posso obter a ``message`` original?

source: The :class:`~ext.commands.Context` contains an attribute, :attr:`~.Context.message` to get the original message.
pt: O :class:`~ext.commands.Context` contém um atributo, :attr:`~.Context.message` para obter a mensagem original.

source: Example: ::
pt: Exemplo: ::

source: How do I make a subcommand?
pt: Como faço um subcomando?

source: Use the ``group`` decorator. This will transform the callback into a ``Group`` which will allow you to add commands into the group operating as "subcommands". These groups can be arbitrarily nested as well.
pt: Use o decorador ``group``. Isso vai transformar o callback em um ``Group`` que vai permitir adicionar comandos no grupo que funciona como "subcomandos". Estes grupos também podem ser arbitrariamente aninhados.

source: This could then be used as ``?git push origin master``.
pt: Isto poderia ser usado como ``?git push origin master``.
