Repository: uKaigo/discord.py
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: pt

source: discord.ext.commands API Reference
pt: referência da API do discord.ext.commands

source: discord.ext.tasks API Reference
pt: referência da API do discord.ext.tasks

source: Welcome to discord.py
pt: Bem vindo ao discord.py

source: discord.py is a modern, easy to use, feature-rich, and async ready API wrapper for Discord.
pt: discord.py é uma API wrapper moderna, fácil de usar, rica em funcionalidades, e assíncrona para o Discord.

source: **Features:**
pt: **Recursos:**

source: Modern Pythonic API using ``async``\/``await`` syntax
pt: API moderna e pythônica usando a sintaxe ``async``\/``await``

source: Sane rate limit handling that prevents 429s
pt: Boa manipulação de rate-limits que previne 429s

source: Implements the entire Discord API
pt: Implementa toda a API do Discord

source: Command extension to aid with bot creation
pt: Extensão de comandos para auxiliar com a criação de bots

source: Easy to use with an object oriented design
pt: Fácil de usar com um design orientado a objetos

source: Optimised for both speed and memory
pt: Otimizado tanto para velocidade quanto para memória

source: Getting started
pt: Primeiros passos

source: Is this your first time using the library? This is the place to get started!
pt: É sua primeira vez usando a biblioteca? Este é o lugar para começar!

source: **First steps:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`
pt: **Primeiros passos:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`

source: **Working with Discord:** :doc:`discord` | :doc:`intents`
pt: **Trabalhando com o Discord:** :doc:`discord` | :doc:`intents`

source: **Examples:** Many examples are available in the :resource:`repository <examples>`.
pt: **Exemplos:** Muitos exemplos estão disponíveis no :resource:`repositório oficial <examples>`.

source: Getting help
pt: Obtendo ajuda

source: If you're having trouble with something, these resources might help.
pt: Se você estiver tendo problemas com alguma coisa, estes recursos podem ajudar.

source: Try the :doc:`faq` first, it's got answers to all common questions.
pt: Experimente o :doc:`faq` primeiro, ele tem respostas para todas as perguntas comuns.

source: Ask us and hang out with us in our :resource:`Discord <discord>` server.
pt: Pergunte para a gente e fique conosco em nosso servidor :resource:`Discord <discord>`.

source: If you're looking for something specific, try the :ref:`index <genindex>` or :ref:`searching <search>`.
pt: Se você está procurando algo específico, tente o :ref:`index <genindex>` ou :ref:`pesquise <search>`.

source: Report bugs in the :resource:`issue tracker <issues>`.
pt: Reporte erros no :resource:`issue tracker <issues>`.

source: Ask in our :resource:`GitHub discussions page <discussions>`.
pt: Pergunte em nossa :resource:`página de discussões no GitHub <discussions>`.

source: Extensions
pt: Extensões

source: These extensions help you during development when it comes to common tasks.
pt: Estas extensões ajudam você durante o desenvolvimento, quando se trata de tarefas comuns.

source: Manuals
pt: Manuais

source: These pages go into great detail about everything the API can do.
pt: Estas páginas entram em grandes detalhes sobre tudo que a API pode fazer.

source: If you're looking for something related to the project itself, it's here.
pt: Se você está procurando algo relacionado ao projeto em si, está aqui.
