Repository: uKaigo/discord.py
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: pt

source: Introduction
pt: Introdução

source: This is the documentation for discord.py, a library for Python to aid in creating applications that utilise the Discord API.
pt: Esta é a documentação do discord.py, uma biblioteca para Python que auxilia na criação de aplicativos que utilizam a API do Discord.

source: Prerequisites
pt: Pré-requisitos

source: discord.py works with Python 3.5.3 or higher. Support for earlier versions of Python is not provided. Python 2.7 or lower is not supported. Python 3.4 or lower is not supported due to one of the dependencies (:doc:`aiohttp <aio:index>`) not supporting Python 3.4.
pt: O discord.py funciona com Python 3.5.3 ou superior. Não é fornecido suporte para versões anteriores do Python. Python 2.7 ou inferior não é suportado. O Python 3.4 ou inferior não é suportado devido a uma das dependências (:doc:`aiohttp <aio:index>`) que não suporta o Python 3.4.

source: Installing
pt: Instalando

source: You can get the library directly from PyPI: ::
pt: Você pode obter a biblioteca diretamente do PyPI: ::

source: If you are using Windows, then the following should be used instead: ::
pt: Se você estiver usando o Windows, então o seguinte deve ser usado: ::

source: To get voice support, you should use ``discord.py[voice]`` instead of ``discord.py``, e.g. ::
pt: Para obter suporte de voz, você deve usar ``discord.py[voice]`` ao invés de ``discord.py``, ex.: ::

source: On Linux environments, installing voice requires getting the following dependencies:
pt: Em ambientes Linux, instalar voz requer obter as seguintes dependências:

source: For a Debian-based system, the following command will get these dependencies:
pt: Para um sistema baseado em Debian, o seguinte comando obterá estas dependências:

source: Remember to check your permissions!
pt: Lembre-se de verificar suas permissões!

source: Virtual Environments
pt: Ambientes Virtuais

source: Sometimes you want to keep libraries from polluting system installs or use a different version of libraries than the ones installed on the system. You might also not have permissions to install libraries system-wide. For this purpose, the standard library as of Python 3.3 comes with a concept called "Virtual Environment"s to help maintain these separate versions.
pt: Às vezes, você quer evitar que as bibliotecas poluam as instalações do sistema ou usar uma versão de bibliotecas diferente das instaladas no sistema. Você também pode não ter permissões para instalar bibliotecas em todo o sistema. Para este propósito, a biblioteca padrão do Python 3.3 vem com um conceito chamado "Ambiente Virtual" para ajudar a manter essas versões separadas.

source: A more in-depth tutorial is found on :doc:`py:tutorial/venv`.
pt: Um tutorial mais aprofundado é encontrado em :doc:`py:tutorial/venv`.

source: However, for the quick and dirty:
pt: No entanto, para a gambiarra:

source: Go to your project's working directory:
pt: Vá para o diretório do seu projeto:

source: Activate the virtual environment:
pt: Ative o ambiente virtual:

source: On Windows you activate it with:
pt: No Windows, você o ativará com:

source: Use pip like usual:
pt: Use pip como de costume:

source: Congratulations. You now have a virtual environment all set up.
pt: Parabéns. Agora você tem um ambiente virtual configurado.

source: Basic Concepts
pt: Conceitos Básicos

source: discord.py revolves around the concept of :ref:`events <discord-api-events>`. An event is something you listen to and then respond to. For example, when a message happens, you will receive an event about it that you can respond to.
pt: O discord.py gira em torno do conceito de :ref:`eventos <discord-api-events>`. Um evento é algo que você ouve e então responde. Por exemplo, quando uma mensagem é criada, você receberá um evento sobre isso que você pode responder.

source: A quick example to showcase how events work:
pt: Um exemplo rápido para mostrar como os eventos funcionam:
