Repository: uKaigo/discord.py
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: pt_br

source: Quickstart
pt_br: Inicio Rápido

source: This page gives a brief introduction to the library. It assumes you have the library installed, if you don't check the :ref:`installing` portion.
pt_br: Esta página faz uma breve introdução à biblioteca. Ela presume que você tem a biblioteca instalada, se você não tem, cheque a seção :ref:`installing`.

source: A Minimal Bot
pt_br: Um Bot Simples

source: Let's make a bot that responds to a specific message and walk you through it.
pt_br: Vamos fazer um bot que responde a uma mensagem específica e te guiar por ele.

source: It looks something like this:
pt_br: Irá se parecer com isso:

source: Let's name this file ``example_bot.py``. Make sure not to name it ``discord.py`` as that'll conflict with the library.
pt_br: Vamos nomear este arquivo como ``example_bot.py``. Certifique-se de não o nomear como ``discord.py`` já que ele vai entrar em conflito com a biblioteca.

source: There's a lot going on here, so let's walk you through it step by step.
pt_br: Há muita coisa acontecendo aqui, então vamos te guiar passo a passo.

source: The first line just imports the library, if this raises a `ModuleNotFoundError` or `ImportError` then head on over to :ref:`installing` section to properly install.
pt_br: A primeira linha apenas importa a biblioteca, se isso gera um `ModuleNotFoundError` ou `ImportError`, então vá até a seção :ref:`installing` para instalar corretamente.

source: Next, we create an instance of a :class:`Client`. This client is our connection to Discord.
pt_br: Em seguida, criamos uma instância de um :class:`Client`. Este cliente é nossa conexão com o Discord.

source: We then use the :meth:`Client.event` decorator to register an event. This library has many events. Since this library is asynchronous, we do things in a "callback" style manner.
pt_br: Então usamos o decorador :meth:`Client.event` para registrar um evento. Esta biblioteca tem muitos eventos. Como esta biblioteca é assíncrona, fazemos as coisas de forma "callback".

source: A callback is essentially a function that is called when something happens. In our case, the :func:`on_ready` event is called when the bot has finished logging in and setting things up and the :func:`on_message` event is called when the bot has received a message.
pt_br: Um callback é essencialmente uma função que é chamada quando algo acontece. No nosso caso o evento :func:`on_ready` é chamado quando o bot terminou de logar e configurar as coisas e o evento :func:`on_message` é chamado quando o bot recebeu uma mensagem.

source: Since the :func:`on_message` event triggers for *every* message received, we have to make sure that we ignore messages from ourselves. We do this by checking if the :attr:`Message.author` is the same as the :attr:`Client.user`.
pt_br: Como o evento :func:`on_message` aciona para *todas* as mensagens recebidas, temos que nos certificar de que ignoramos as mensagens de nós mesmos. Fazemos isso verificando se o :attr:`Message.author` é o mesmo que o :attr:`Client.user`.

source: Afterwards, we check if the :class:`Message.content` starts with ``'$hello'``. If it is, then we send a message in the channel it was used in with ``'Hello!'``.
pt_br: Depois disso, verificamos se o :class:`Message.content` começa com ``'$hello'``. Se sim, nós enviamos uma mensagem no canal que foi usado com ``'Hello!'``.

source: Finally, we run the bot with our login token. If you need help getting your token or creating a bot, look in the :ref:`discord-intro` section.
pt_br: Finalmente, nós executamos o bot com nosso token de login. Se você precisar de ajuda para pegar seu token ou criar um bot, procure na seção :ref:`discord-intro`.

source: Now that we've made a bot, we have to *run* the bot. Luckily, this is simple since this is just a Python script, we can run it directly.
pt_br: Agora que fizemos um bot, temos que *executar* o bot. Felizmente, isso é simples, já que é apenas um script Python, podemos executá-lo diretamente.

source: On Windows:
pt_br: No Windows:

source: On other systems:
pt_br: Em outros sistemas:
